src_test/extensions-testbed/results/1.3.1/cipher-return-false-cout/soap-trace-client.log

Tracing Web Service client: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Inbound SOAP message forced back to client:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
