branches/1_4_under_construction/src_test/extensions-testbed/results/1.3.1/cipher-throw-wsinterceptorexception-cout/soap-trace-client.log

Tracing Web Service client: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Inbound SOAP message containing a Fault forced back to client:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <S:Fault>
      <faultcode>S:Client</faultcode>
      <faultstring>Extension failed to decipher message</faultstring>
    </S:Fault>
  </S:Body>
</S:Envelope>
